Revit 2024 API
Generic.GenericTransparencyImageFade Property
 The property labeled "Image Fade" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GenericTransparencyImageFade { get; }
Visual Basic
Public Shared ReadOnly Property GenericTransparencyImageFade As String
	Get
Visual C++
public:
static property String^ GenericTransparencyImageFade {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace